# Blend Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Blend Class
Members See Also
---
A blend solid or void form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Blend : GenericForm
```

Visual Basic
---
```text
Public Class Blend _
	Inherits GenericForm
```

Visual C++
---
```text
public ref class Blend : public GenericForm
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CombinableElement Autodesk.Revit.DB..::..GenericForm Autodesk.Revit.DB..::..Blend
# See Also
Blend Members
Autodesk.Revit.DB Namespace